In [2]:
'''
    #       # #   # ##### ####### #
    # #   # # \  /  #     #     # #
    #   #   #  \/   ##### #     # #
    #       #  #        # #  #### #
    #       #  #    ##### ####### ######
    
   Author name: Tarun Sharma 
   Schema Name: Movie Theatres
'''    
import sqlalchemy
import pymysql
pymysql.install_as_MySQLdb()
sqlalchemy.create_engine('mysql://root:root@localhost/The_Movie_Theatres')
%load_ext sql
%sql mysql://root:root@localhost/Movie_Theatres

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%%sql
CREATE TABLE Movies (
  Code INTEGER PRIMARY KEY,
  Title VARCHAR(255) NOT NULL,
  Rating VARCHAR(255) 
);

 * mysql://root:***@localhost/Movie_Theatres
0 rows affected.

[]

In [5]:
%%sql
CREATE TABLE MovieTheaters (
  Code INTEGER PRIMARY KEY,
  Name VARCHAR(255) NOT NULL,
  Movie INTEGER,  
    FOREIGN KEY (Movie) REFERENCES Movies(Code)
) ENGINE=INNODB;

 * mysql://root:***@localhost/Movie_Theatres
0 rows affected.

[]

In [6]:
%%sql
INSERT INTO Movies(Code,Title,Rating) VALUES(1,'Citizen Kane','PG');
INSERT INTO Movies(Code,Title,Rating) VALUES(2,'Singin'' in the Rain','G');
INSERT INTO Movies(Code,Title,Rating) VALUES(3,'The Wizard of Oz','G');
INSERT INTO Movies(Code,Title,Rating) VALUES(4,'The Quiet Man',NULL);
INSERT INTO Movies(Code,Title,Rating) VALUES(5,'North by Northwest',NULL);
INSERT INTO Movies(Code,Title,Rating) VALUES(6,'The Last Tango in Paris','NC-17');
INSERT INTO Movies(Code,Title,Rating) VALUES(7,'Some Like it Hot','PG-13');
INSERT INTO Movies(Code,Title,Rating) VALUES(8,'A Night at the Opera',NULL);

 * mysql://root:***@localhost/Movie_Theatres
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(1,'Odeon',5);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(2,'Imperial',1);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(3,'Majestic',NULL);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(4,'Royale',6);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(5,'Paraiso',3);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(6,'Nickelodeon',NULL);

 * mysql://root:***@localhost/Movie_Theatres
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [10]:
%%sql
-- Select the title of all movies.
select title from Movies;

 * mysql://root:***@localhost/Movie_Theatres
8 rows affected.

[('Citizen Kane',),
 ("Singin' in the Rain",),
 ('The Wizard of Oz',),
 ('The Quiet Man',),
 ('North by Northwest',),
 ('The Last Tango in Paris',),
 ('Some Like it Hot',),
 ('A Night at the Opera',)]

In [11]:
%%sql
-- Show all the distinct ratings in the database.
select distinct rating from Movies;

 * mysql://root:***@localhost/Movie_Theatres
5 rows affected.

[('PG',), ('G',), (None,), ('NC-17',), ('PG-13',)]

In [12]:
%%sql
-- Show all unrated movies.
select * 
from Movies
where rating is NULL;

 * mysql://root:***@localhost/Movie_Theatres
3 rows affected.

[(4, 'The Quiet Man', None),
 (5, 'North by Northwest', None),
 (8, 'A Night at the Opera', None)]

In [13]:
%%sql
-- Select all movie theaters that are not currently showing a movie.
select * from MovieTheaters
where Movie is NULL;

 * mysql://root:***@localhost/Movie_Theatres
2 rows affected.

[(3, 'Majestic', None), (6, 'Nickelodeon', None)]

In [16]:
%%sql
show tables;

 * mysql://root:***@localhost/Movie_Theatres
2 rows affected.

[('MovieTheaters',), ('Movies',)]

In [19]:
%%sql
Desc MovieTheaters

 * mysql://root:***@localhost/Movie_Theatres
3 rows affected.

[('Code', 'int', 'NO', 'PRI', None, ''),
 ('Name', 'varchar(255)', 'NO', '', None, ''),
 ('Movie', 'int', 'YES', 'MUL', None, '')]

In [20]:
%%sql
Desc Movies;

 * mysql://root:***@localhost/Movie_Theatres
3 rows affected.

[('Code', 'int', 'NO', 'PRI', None, ''),
 ('Title', 'varchar(255)', 'NO', '', None, ''),
 ('Rating', 'varchar(255)', 'YES', '', None, '')]

In [21]:
%%sql
-- correct query
SELECT * FROM MovieTheaters LEFT JOIN Movies ON MovieTheaters.Movie = Movies.Code;

 * mysql://root:***@localhost/Movie_Theatres
0 rows affected.

[]

In [ ]:
%%sql
-- Select all data from all movies and, if that movie is being shown in a theater, show the data from the theater.
-- the query below would fail
select *
from movies right join movietheaters 
on movies.code = movietheaters.movie;

In [22]:
%%sql
SELECT *
FROM Movies LEFT JOIN MovieTheaters
ON Movies.Code = MovieTheaters.Movie;

 * mysql://root:***@localhost/Movie_Theatres
8 rows affected.

[(1, 'Citizen Kane', 'PG', 2, 'Imperial', 1),
 (2, "Singin' in the Rain", 'G', None, None, None),
 (3, 'The Wizard of Oz', 'G', 5, 'Paraiso', 3),
 (4, 'The Quiet Man', None, None, None, None),
 (5, 'North by Northwest', None, 1, 'Odeon', 5),
 (6, 'The Last Tango in Paris', 'NC-17', 4, 'Royale', 6),
 (7, 'Some Like it Hot', 'PG-13', None, None, None),
 (8, 'A Night at the Opera', None, None, None, None)]

In [35]:
%%sql
-- Show the titles of movies not currently being shown in any theaters.
-- VERY IMPORTANT!!!
-- the query below would FAIL due to the NULL value returned by the subquery
select Title from Movies where Code not in (select Movie from MovieTheaters);

 * mysql://root:***@localhost/Movie_Theatres
0 rows affected.

[]

In [39]:
%%sql 
select * from Movies

 * mysql://root:***@localhost/Movie_Theatres
8 rows affected.

[(1, 'Citizen Kane', 'PG'),
 (2, "Singin' in the Rain", 'G'),
 (3, 'The Wizard of Oz', 'G'),
 (4, 'The Quiet Man', None),
 (5, 'North by Northwest', None),
 (6, 'The Last Tango in Paris', 'NC-17'),
 (7, 'Some Like it Hot', 'PG-13'),
 (8, 'A Night at the Opera', None)]

In [40]:
%%sql
Desc Movies

 * mysql://root:***@localhost/Movie_Theatres
3 rows affected.

[('Code', 'int', 'NO', 'PRI', None, ''),
 ('Title', 'varchar(255)', 'NO', '', None, ''),
 ('Rating', 'varchar(255)', 'YES', '', None, '')]

In [46]:
%%sql
INSERT INTO Movies(Code,Title) VALUES(9,"Raja Rencho");

 * mysql://root:***@localhost/Movie_Theatres
1 rows affected.

[]

In [47]:
%%sql
-- Set the rating of all unrated movies to "G".
UPDATE Movies
SET Rating = 'G'
WHERE Rating is NULL;

 * mysql://root:***@localhost/Movie_Theatres
4 rows affected.

[]

In [48]:
%%sql
-- Remove movie theaters projecting movies rated "NC-17".
delete from MovieTheaters 
where Movie in (
select Code from Movies where Rating = 'NC-17'
);

 * mysql://root:***@localhost/Movie_Theatres
1 rows affected.

[]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql